src/Catalogs/ДрайверыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДрайверыОборудования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагруженныйДрайвер</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаДрайвера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДрайвера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяДистрибутивом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДрайвера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятСПоддержки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ДрайверыОборудования/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция возвращает структуру с данными драйвера оборудования
// 
// Возвращаемое значение:
//   Структура - Структура с данными драйвера оборудования
//
Функция ПолучитьДанныеДрайвера(Идентификатор) Экспорт

	ДанныеДрайвера = Новый Структура();

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДрайверыОборудованияПереопределяемый.Ссылка,
	|	ДрайверыОборудованияПереопределяемый.ИмяПредопределенныхДанных КАК Имя,
	|	ДрайверыОборудованияПереопределяемый.ТипОборудования КАК ТипОборудования,
	|	ДрайверыОборудованияПереопределяемый.Предопределенный КАК ВСоставеКонфигурации,
	|	ДрайверыОборудованияПереопределяемый.ИдентификаторОбъекта КАК ИдентификаторОбъекта, 
	|	ДрайверыОборудованияПереопределяемый.ОбработчикДрайвера КАК ОбработчикДрайвера,
	|	ДрайверыОборудованияПереопределяемый.ПоставляетсяДистрибутивом КАК ПоставляетсяДистрибутивом, 
	|	ДрайверыОборудованияПереопределяемый.ЗагруженныйДрайвер КАК ЗагруженныйДрайвер,  
	|	ДрайверыОборудованияПереопределяемый.ИмяФайлаДрайвера  КАК ИмяФайлаДрайвера,  
	|	ДрайверыОборудованияПереопределяемый.ИмяМакетаДрайвера КАК ИмяМакетаДрайвера,
	|	ДрайверыОборудованияПереопределяемый.ВерсияДрайвера    КАК ВерсияДрайвера
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудованияПереопределяемый
	|ГДЕ
	|	 ДрайверыОборудованияПереопределяемый.Ссылка = &Идентификатор");
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	                                                           
	Если Выборка.Следующий() Тогда
		// Заполним структуру данных устройства.
		ДанныеДрайвера.Вставить("ДрайверОборудования"       , Выборка.Ссылка);
		ДанныеДрайвера.Вставить("ДрайверОборудованияИмя"    , Выборка.Имя);
		ДанныеДрайвера.Вставить("ТипОборудования"           , Выборка.ТипОборудования);
		ДанныеДрайвера.Вставить("ВСоставеКонфигурации"      , Выборка.ВСоставеКонфигурации);
		ДанныеДрайвера.Вставить("ИдентификаторОбъекта"      , Выборка.ИдентификаторОбъекта);
		ДанныеДрайвера.Вставить("ОбработчикДрайвера"        , Выборка.ОбработчикДрайвера);
		ДанныеДрайвера.Вставить("ПоставляетсяДистрибутивом" , Выборка.ПоставляетсяДистрибутивом);
		ДанныеДрайвера.Вставить("ИмяМакетаДрайвера"         , Выборка.ИмяМакетаДрайвера);
		ДанныеДрайвера.Вставить("ИмяФайлаДрайвера"          , Выборка.ИмяФайлаДрайвера);
		ДанныеДрайвера.Вставить("ВерсияДрайвера"            , Выборка.ВерсияДрайвера);
	КонецЕсли;
	
	Возврат ДанныеДрайвера;
	
	
КонецФункции

// Процедура заполняет предопределенный элемент справочника.
//
Процедура ЗаполнитьПредопределенныйЭлемент(
	ОбработчикДрайвера,
	ИдентификаторОбъекта		= Неопределено, 
	ИмяМакетаДрайвера			= Неопределено, 
	ПоставляетсяДистрибутивом	= Ложь, 
	ВерсияДрайвера				= Неопределено,
	СнятСПоддержки				= Ложь,
	ИмяФайлаДрайвера			= Неопределено // нет в БПО.
	) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры = МенеджерОборудованияВызовСервера.ПараметрыДрайвераПоОбработчику(Строка(ОбработчикДрайвера));
	
	ВремИмяЭлемента = СтрЗаменить(Параметры.Имя, "Обработчик", "Драйвер");
	
	Попытка
		Драйвер = МенеджерОборудованияВызовСервера.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования." + ВремИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ДрайверыОборудования." + ВремИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если Драйвер = Неопределено Тогда  
		Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();
		Драйвер.ИмяПредопределенныхДанных = ВремИмяЭлемента;     
		Драйвер.ТипОборудования           = Параметры.ТипОборудования;
		Драйвер.ОбработчикДрайвера        = ОбработчикДрайвера;
		НужнаЗапись = Истина;
	Иначе 
		Драйвер = Драйвер.ПолучитьОбъект();
		
		НужнаЗапись = Ложь;
		
		Если Не ЗначениеЗаполнено(Драйвер.ОбработчикДрайвера) Тогда
			Драйвер.ОбработчикДрайвера        = ОбработчикДрайвера;
			НужнаЗапись = Истина;
		КонецЕсли;
		
		Если Драйвер.ИмяПредопределенныхДанных = "ДрайверКассовогоСервера" И Не ЗначениеЗаполнено(Драйвер.ТипОборудования) И Параметры.Свойство("ТипОборудования") Тогда
			Драйвер.ТипОборудования        = Параметры.ТипОборудования;
			НужнаЗапись = Истина;
		КонецЕсли;
		
		Если (Драйвер.Наименование <> Параметры.Наименование)
			Или (Драйвер.ИдентификаторОбъекта <> Строка(ИдентификаторОбъекта))
			Или (Драйвер.ИмяМакетаДрайвера <> Строка(ИмяМакетаДрайвера))
			Или (Драйвер.ПоставляетсяДистрибутивом <> ПоставляетсяДистрибутивом)
			Или (Драйвер.ВерсияДрайвера <> Строка(ВерсияДрайвера))
			Или (Драйвер.СнятСПоддержки <> СнятСПоддержки) Тогда
			НужнаЗапись = Истина;
		КонецЕсли;  
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		Драйвер.Наименование              = Параметры.Наименование;
		Драйвер.ИдентификаторОбъекта      = ИдентификаторОбъекта;
		Драйвер.ИмяМакетаДрайвера         = ИмяМакетаДрайвера; 
		Драйвер.ПоставляетсяДистрибутивом = ПоставляетсяДистрибутивом;
		Драйвер.ВерсияДрайвера            = ВерсияДрайвера;
		Драйвер.СнятСПоддержки            = СнятСПоддержки;
		
		Если ЗначениеЗаполнено(ИмяФайлаДрайвера) Тогда
			// Драйвер.ИмяФайлаДрайвера = "MercuryFPDrv.exe";
			Драйвер.ИмяФайлаДрайвера = ИмяФайлаДрайвера;
		КонецЕсли;
		
		Драйвер.Записать();
	КонецЕсли;
		
КонецПроцедуры
// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "Справочник.ДрайверыОборудования";
	МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецЕсли

#КонецОбласти
